uhnp/src/Enums/НДФЛСтавкиНалогообложенияРезидента/НДФЛСтавкиНалогообложенияРезидента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НДФЛСтавкиНалогообложенияРезидента</name>
  <enumValues>
    <name>Ставка09</name>
  </enumValues>
  <enumValues>
    <name>Ставка13</name>
  </enumValues>
  <enumValues>
    <name>Ставка35</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДоходовИсполнительногоПроизводства/ВидыДоходовИсполнительногоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоходовИсполнительногоПроизводства</name>
  <enumValues>
    <name>ДоходыБезОграниченияВзысканий</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВознаграждения</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемые</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемыеПериодические</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемыеПериодические</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииНеоблагаемыеЕдиновременные</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
  <enumValues>
    <name>КомпенсацииОблагаемыеЕдиновременные</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ВозвратНДФЛ/ВозвратНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратНДФЛ</name>
  <comment>АПК:93 Представления объекта и списка совпадают с синонимом, а расширенные - нет.</comment>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>InformationRegister.ПорядокВыплатыДокументов</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплатеАвансом</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплате</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СуммыВозврата</name>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПоСтавке13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПоСтавке09</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПоСтавке35</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрацияВНалоговомОргане</name>
      <comment>АПК:58 Имя неверно образовано из синонима.</comment>
      <type>
        <types>CatalogRef.РегистрацииВНалоговомОргане</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцНалоговогоПериода</name>
      <comment>АПК:58 имя сохранено ради обратной совместимости</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияДохода</name>
      <comment>АПК:58 имя ВидДохода уже занято</comment>
      <type>
        <types>EnumRef.КатегорииДоходовНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНалогообложенияРезидента</name>
      <type>
        <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалогСПревышения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалогСПревышенияПоСтавке18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалогСПревышенияПоСтавке20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НалогСПревышенияПоСтавке22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеРезультатовУдержаний</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>EnumRef.ВидыОсобыхНачисленийИУдержаний</types>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяФинансирования</name>
      <type>
        <types>CatalogRef.СтатьиФинансированияЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиРасходовЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеУчетаЗатрат</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоходаИсполнительногоПроизводства</name>
      <type>
        <types>EnumRef.ВидыДоходовИсполнительногоПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/CommonModules/ВозвратНДФЛБазовый/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция УдержанияПоРабочимМестам(РеквизитыДляПроведения) Экспорт 
	
	ФизическоеЛицо 	= РеквизитыДляПроведения.ФизическоеЛицо;
	Организация 	= РеквизитыДляПроведения.Организация;
	Период 			= РеквизитыДляПроведения.Месяц;
	
	ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	НакопленныеКорректировки = ВзаиморасчетыССотрудниками.КорректировкиВыплаты(Организация, Период, ФизическиеЛица, РеквизитыДляПроведения.Ссылка);
	НакопленныеКорректировки.Колонки.СуммаКорректировки.Имя = "Сумма";
	
	ТаблицаНДФЛ = Новый ТаблицаЗначений;
	ТаблицаНДФЛ.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаНДФЛ.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаНДФЛ.Колонки.Добавить("ВидУдержания", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний"));
	ТаблицаНДФЛ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаНДФЛ.Колонки.Добавить("ВидДоходаИсполнительногоПроизводства", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства"));
	ТаблицаНДФЛ.Колонки.Добавить("БазаПоУмолчанию", Новый ОписаниеТипов("Булево"));
	
	ИменаРесурсовНалога = УчетНДФЛ.РесурсыИсчисленногоНалогаВМассиве("Налог");
	ВидыУдержанийПоКолонкамДанных = Перечисления.ВидыОсобыхНачисленийИУдержаний.СоответствиеКолонкамДанных("Налог");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДляПроведения.Ссылка);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВозвратНДФЛ.ИдентификаторСтрокиНДФЛ КАК ИдентификаторСтрокиНДФЛ,
	|	0 КАК Сумма,
	|	ВозвратНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВозвратНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента
	|ИЗ
	|	Документ.ВозвратНДФЛ.СуммыВозврата КАК ВозвратНДФЛ
	|ГДЕ
	|	ВозвратНДФЛ.Ссылка = &Ссылка";
	ТекстНалогов = "";
	Для каждого ИмяРесурса Из ИменаРесурсовНалога Цикл
		ТекстНалогов = ТекстНалогов + "ВозвратНДФЛ." + ИмяРесурса + " КАК " + ИмяРесурса + "," + Символы.ПС;
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "0 КАК Сумма,", ТекстНалогов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РегистрацииВНалоговомОргане = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		
		Для каждого ИмяРесурса Из ИменаРесурсовНалога Цикл
			Если Выборка[ИмяРесурса] > 0 Тогда
				НоваяСтрока = ТаблицаНДФЛ.Добавить();
				НоваяСтрока.ИдентификаторСтроки = Выборка.ИдентификаторСтрокиНДФЛ;
				НоваяСтрока.ФизическоеЛицо 		= ФизическоеЛицо;
				НоваяСтрока.Сумма 				= Выборка[ИмяРесурса];
				НоваяСтрока.ВидУдержания 		= ВидыУдержанийПоКолонкамДанных[ИмяРесурса];
				НоваяСтрока.БазаПоУмолчанию 	= (Выборка.СтавкаНалогообложенияРезидента <> Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
				НоваяСтрока.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ЗарплатаВознаграждения;
			КонецЕсли;
		КонецЦикла;
		
		РегистрацииВНалоговомОргане.Вставить(Выборка.ИдентификаторСтрокиНДФЛ, Выборка.РегистрацияВНалоговомОргане);
	
	КонецЦикла;
	
	РезультатыРаспределения = ОтражениеЗарплатыВУчете.ВозвратНДФЛПоРабочимМестамИСтатьям(ТаблицаНДФЛ, НакопленныеКорректировки, Организация, Период);
	
	УдержанияПоРабочимМестам = УчетНачисленнойЗарплаты.ТаблицаРаспределенияПоРабочимМестам();
	
	Для каждого СтрокаТЗ Из РезультатыРаспределения Цикл
		НоваяСтрока = УдержанияПоРабочимМестам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыДляПроведения);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		НоваяСтрока.НачислениеУдержание = СтрокаТЗ.ВидУдержания;
		НоваяСтрока.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане[СтрокаТЗ.ИдентификаторСтроки];
		НоваяСтрока.Сумма = СтрокаТЗ.Результат;
	КонецЦикла;
	
	Возврат УдержанияПоРабочимМестам;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Документ, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
